#include <iostream>
using namespace std;
int main()
{
	setlocale(0, "");
	int a;
	cout << "Введите четырёхзначное число: ";
		cin >> a;

		//Немножко поигрался с операторами if / else, так как хотел сделать проверку на то, действительно ли пользователь ввёл четырёхзначное число

		if (a >= 1000 && a <= 9999) {
		
			int one = a / 1000;
			int two = a % 10;
			cout << "Первая цифра: " << one << endl;
			cout << "Последняя цифра: " << two << endl;

	}
	
		else {
			cout << "Это не четырёхзначное число!" << endl;
		}

		//Теперь при вводе НЕ четырёхзначного числа, программа сообщает пользователю об этом

		return 0;

}